## Slicing Dataframe using Loc and iLoc

In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame({
'Name':['Sahil','Sonia','Sourav','Vishal'],
'Age':[10,20,30,40],
'Gender':['M','F','M','M'],
'City':['J','K','L','P'],
'Work':[True,False,False,True]
}
)
df

     Name  Age Gender City   Work
0   Sahil   10      M    J   True
1   Sonia   20      F    K  False
2  Sourav   30      M    L  False
3  Vishal   40      M    P   True

### Accessing columns by Names

#### Accessing single column

In [4]:
df['Name'] # Series

0     Sahil
1     Sonia
2    Sourav
3    Vishal
Name: Name, dtype: object

In [7]:
# Getting the value of column
df['Name'][2]

'Sourav'

In [5]:
df[['Name']] # Dataframe

     Name
0   Sahil
1   Sonia
2  Sourav
3  Vishal

In [6]:
df.Name  # Another way

0     Sahil
1     Sonia
2    Sourav
3    Vishal
Name: Name, dtype: object

#### Accessing multiple columns

In [7]:
df[['Name','Age','Gender']]

     Name  Age Gender
0   Sahil   10      M
1   Sonia   20      F
2  Sourav   30      M
3  Vishal   40      M

In [8]:
# Another way
list_cols=['Name','Gender']
df[list_cols]

     Name Gender
0   Sahil      M
1   Sonia      F
2  Sourav      M
3  Vishal      M

#### Using loc

- df.loc[rows,columns] # Note:square brackets are used with loc
    - all rows or filtered rows
    - example, df.loc[df['age']>50,'name'] === df[df['age']['name']
    - df.loc[0,:]
    - df.loc[[1,2,3],:]
    - df.loc[[1,2,3]:['Name,'Age','Gender']

In [9]:
df.loc[:,['Name','Gender']]

     Name Gender
0   Sahil      M
1   Sonia      F
2  Sourav      M
3  Vishal      M

### Accessing range of columns

#### By index

In [10]:
df.iloc[:,[1,4]]

   Age   Work
0   10   True
1   20  False
2   30  False
3   40   True

#### By Name

In [11]:
df.loc[:,['Name','Gender']]

     Name Gender
0   Sahil      M
1   Sonia      F
2  Sourav      M
3  Vishal      M

In [12]:
df.iloc[:,1:4]

   Age Gender City
0   10      M    J
1   20      F    K
2   30      M    L
3   40      M    P

In [13]:
df.loc[:,'Name':'Gender']

     Name  Age Gender
0   Sahil   10      M
1   Sonia   20      F
2  Sourav   30      M
3  Vishal   40      M

#### Give all columns of 0th row

In [14]:
df.loc[0,:]

Name      Sahil
Age          10
Gender        M
City          J
Work       True
Name: 0, dtype: object

#### Give all columns of first 3 rows

In [15]:
df.loc[[0,1,2],:]

     Name  Age Gender City   Work
0   Sahil   10      M    J   True
1   Sonia   20      F    K  False
2  Sourav   30      M    L  False

### Notes

- loc is used to access through names
- iloc is used to access through indexes
- , in used to select given columns
- : is used to select range of columns
- if you want particular columns during fetching dataframe,use columns=list of columns you want to select

![g](https://i2.wp.com/sparkbyexamples.com/wp-content/uploads/2021/10/pandas-difference-loc-vs-iloc.png?resize=840%2C353&ssl=1)

### Summary

In [24]:
# Get first row 
df.loc[0]

Name      Sahil
Age          10
Gender        M
City          J
Work       True
Name: 0, dtype: object

In [17]:
# Get first two rows 
df.loc[0:1]

    Name  Age Gender City   Work
0  Sahil   10      M    J   True
1  Sonia   20      F    K  False

In [18]:
# Get first two rows's specific column
df.loc[0:1].Name

0    Sahil
1    Sonia
Name: Name, dtype: object

In [19]:
# Get even numbered rows
df.loc[df.index%2==0]

     Name  Age Gender City   Work
0   Sahil   10      M    J   True
2  Sourav   30      M    L  False

In [20]:
# Get odd numbered rows
df.loc[df.index%2!=0]

     Name  Age Gender City   Work
1   Sonia   20      F    K  False
3  Vishal   40      M    P   True

In [22]:
# Add steps in rows
# Select every nth row
# df[df.index % n == 0]  # Selects every nth raw starting from 0
df[df.index % 2 == 0]

     Name  Age Gender City   Work
0   Sahil   10      M    J   True
2  Sourav   30      M    L  False

In [23]:
# Excludes every nth row
df[df.index % 3 != 0]

     Name  Age Gender City   Work
1   Sonia   20      F    K  False
2  Sourav   30      M    L  False